"""
strings

1)написати прогу яка вибирає зі введеної строки цифри і виводить їх через кому,
наприклад:
st = 'as 23 fdfdg544' введена строка
2,3,5,4,4        #вивело в консолі.

#################################################################################

#################################################################################

list comprehension

1)есть строка:
greeting = 'Hello, world'
записать каждый символ в лист поменяв его на верхний регистр
пример:
['H', 'E', 'L', 'L', 'O', ',', ' ', 'W', 'O', 'R', 'L', 'D']

2) с диапазона от 0-50 записать в лист только не парные числа, при этом возвести их в квадрат
пример:
[0, 1, 4, 9, 16, 25, 36, 49, 64, 81, 100, 121, 144, 169, 196, 225, 256, 289, 324, ...]

function

- створити функцію яка виводить ліст
- створити функцію яка приймає три числа та виводить та повертає найменьше.
- створити функцію яка приймає три числа та виводить та повертає найбільше.
- створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше
- створити функцію яка виводить ліст
- створити функцію яка повертає найбільше число з ліста
- створити функцію яка повертає найменьше число з ліста
- створити функцію яка приймає ліст чисел та складає значення елементів ліста та повертає його.
- створити функцію яка приймає ліст чисел та повертає середнє арифметичне його значень.







#################################################################################################
1)Дан лист:
  list = [22, 3,5,2,8,2,-23, 8,23,5]
  - найти min число в листе
  - удалить все дубликаты в листе
  - заменить каждое четвертое значение на "Х"
2)вывести на экран пустой квадрат из "*" сторона которого указана в переменой:
3) вывести табличку умножения с помощью цикла while
4) переделать первое задание под меню с помощью цикла

***  - вывести элемент листа, значение которого ближе всего к среднему арифметическому всех элементов этого же листа
пример:

[1, 2, 3, 4, 5, 6, 7, 8, 9] => 5
[-1, -2, 3, 4, 555] => 4
[5, 5, 5, 5] => 5
[-10, 5, 5] => 5
"""

# 1)написати прогу яка вибирає зі введеної строки цифри і виводить їх через кому,наприклад:
# st = 'as 23 fdfdg544' введена строка
# 2,3,5,4,4        #вивело в консолі.

st = 'as 23 fdfdg544'
print(','.join(n for n in st if n.isdigit()))

# 2)написати прогу яка вибирає зі введеної строки числа і виводить їх
# так як вони написані
# наприклад:
# st = 'as 23 fdfdg544 34' #введена строка
# 23, 544, 34              #вивело в консолі
st = 'as 23 fdfdg544 34'
num = ''
for n in st:
    if n.isdigit():
        num = num + n
        print("num is " + num)


# list comprehension

# 1)есть строка:
# greeting = 'Hello, world'
# записать каждый символ в лист поменяв его на верхний регистр
# пример:
# ['H', 'E', 'L', 'L', 'O', ',', ' ', 'W', 'O', 'R', 'L', 'D']
greeting = 'Hello, world'
greeting_upper = [greeting.upper()for greeting_upper in greeting]
print(greeting_upper)

# 2) с диапазона от 0-50 записать в лист только не парные числа, при этом возвести их в квадрат
# пример:
# [0, 1, 4, 9, 16, 25, 36, 49, 64, 81, 100, 121, 144, 169, 196, 225, 256, 289, 324, ...]
nums_1 = [i * i for i in range(50)]
print(nums_1)

# function
#
# - створити функцію яка виводить ліст
# - створити функцію яка приймає три числа та виводить та повертає найменьше.
# - створити функцію яка приймає три числа та виводить та повертає найбільше.
# - створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше

l = [123, 'qwe', True]


def func_1():
    print([l])
    func_1()



def func_2(a,b,c):
    if a > b and a > c:
        print(a)
    elif b > a and b > c:
        print(b)
    elif c > a and c > b:
        print(c)
func_2(1,2,3)


def func_3(a,b,c):
    if a < b and a < c:
        print(a)
    elif b < a and b < c:
        print(b)
    elif c < a and c < b:
        print(c)
func_3(5,10,15)

def func_4(*args):
    min = args[0]
    for i in args[1:]:
        if i < min:
            min = i
    return min
print(func_4(12,546,784,24,12,6,7,345,2))



# - створити функцію яка виводить ліст
# - створити функцію яка повертає найбільше число з ліста
# - створити функцію яка повертає найменьше число з ліста
# - створити функцію яка приймає ліст чисел та складає значення елементів ліста та повертає його.
# - створити функцію яка приймає ліст чисел та повертає середнє арифметичне його значень.
fib_nums = [1,3,5,8,13,21,34,55,89]

def ls_nums():
    print(fib_nums)
ls_nums()

def max_num():
    print(max(fib_nums))
max_num()

def sum_num():
    print(sum(fib_nums))
sum_num()
def arithmetic_num(*args):
    print(sum(fib_nums) / len(fib_nums))
arithmetic_num()


"""
1)Дан лист:
  list = [22, 3,5,2,8,2,-23, 8,23,5]
  - найти min число в листе
  - удалить все дубликаты в листе
  - заменить каждое четвертое значение на "Х"
2)вывести на экран пустой квадрат из "*" сторона которого указана в переменой:
3) вывести табличку умножения с помощью цикла while
4) переделать первое задание под меню с помощью цикла

***  - вывести элемент листа, значение которого ближе всего к среднему арифметическому всех элементов этого же листа
пример:
[1, 2, 3, 4, 5, 6, 7, 8, 9] => 5
[-1, -2, 3, 4, 555] => 4
[5, 5, 5, 5] => 5
[-10, 5, 5] => 5
"""
list = [22, 3,5,2,8,2,-23, 8,23,5]
print(min(list))
print(set(list))
#list_len = len(list)
#every_4 = list_len // 4
#list[1::2] = [0] * every_4
#print(list)




#2)вывести на экран пустой квадрат из "*" сторона которого указана в переменой:
s, x = '*', 10
print(s * x)
for i in range(x - 2):
    print(s, ' ' * (x - 4), s)

print(s * x)

#3) вывести табличку умножения с помощью цикла while
a = 1
b = 1
while a < 10:
    while b < 10:
        print(a * b, end="\t")
        b += 1
    print("\n")
    b = 1
    a += 1


print('1.find smallest num in list')
# не дуже зрозумів з менюшкою
#***  - вывести элемент листа, значение которого ближе всего к среднему арифметическому всех элементов этого же листа
qwe = [1, 2, 3, 4, 5, 6, 7, 8, 9]
av = sum(qwe) / len(qwe)
print(av)
